hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
/**
 * @file    lcd.c
 * @brief   LCD HAL for EFM32GG STK
 * @version 1.0
 *
 * @note    To debug there is a LCD_EMULATION compiler flag. By defining it, all writes of
 *          segments are directed to a 8x2 array in memory
 *
 * @note    There are at least two segment numbering methods. One of them is the LCD device.
 *          Other of the LCD controller in the microcontroller.
 * @note    The same for common numbering. The numbering of the LCD device is the reverse of the
 *          numbering used in the LCD controller.
 */

//#define LCD_EMULATION


#include  <stdint.h>
#include "lcd.h"

#ifndef LCD_EMULATION
#include "em_device.h"/////////
//#include "efm32gg_lcd.h"
//#include "efm32gg_cmu.h"
#endif

/** BIT macro generates a 1 bit in the N position */
#define BIT(N) (1U<<(N))


/**
 *  @brief  struct to hold information about segment
 *
 *  @note   used two 32-bit words to simplify operations with the segment registers
 */
typedef struct {
    uint32_t    hi;
    uint32_t    lo;
} SegEncoding_t;


/**
 * Flag. When set, clock is initialized.
 */
static uint8_t lcdclock_set = 0;

/**
 *  @brief  Table for 14 segments displays
 *
 *  @note   For each character, it gives the segments to be lit
 *  @note   It uses a 16 bit word and each bit corresponds to a segment
 *  @note   0 position corresponds to space (0x20=32)
 *  @note   To get the segments for character c use segments14forchar[c-' ']
 *
 */

// bit-segment association
#define _DP 0x4000
#define _L  0x2000
#define _M  0x1000
#define _N  0x800
#define _K  0x400
#define _J  0x200
#define _H  0x100
#define _G2 0x80
#define _G1 0x40
#define _F  0x20
#define _E  0x10
#define _D  0x8
#define _C  0x4
#define _B  0x2
#define _A  0x1

const uint16_t segments14forchar[96] = {
            0                                                        , /* (space) */
          _DP                                            |_C |_B     , /* ! */
                              _J                             |_B     , /* " */
                  _M         |_J     |_G2|_G1        |_D |_C |_B     , /* # */
                  _M         |_J     |_G2|_G1|_F     |_D |_C     |_A , /* $ */
              _L |_M |_N |_K |_J |_H |_G2|_G1|_F         |_C         , /* % */
              _L             |_J |_H     |_G1    |_E |_D         |_A , /* & */
                              _J                                     , /* ' */
              _L         |_K                                         , /* ( */
                      _N         |_H                                 , /* ) */
              _L |_M |_N |_K |_J |_H |_G2|_G1                        , /* * */
                  _M         |_J     |_G2|_G1                        , /* + */
                      _N                                             , /* , */
                                      _G2|_G1                        , /* - */
          _DP                                                        , /* . */
                      _N |_K                                         , /* / */
                      _N |_K                 |_F |_E |_D |_C |_B |_A , /* 0 */
                          _K                             |_C |_B     , /* 1 */
                                      _G2|_G1    |_E |_D     |_B |_A , /* 2 */
                                      _G2            |_D |_C |_B |_A , /* 3 */
                                      _G2|_G1|_F         |_C |_B     , /* 4 */
              _L                         |_G1|_F     |_D         |_A , /* 5 */
                                      _G2|_G1|_F |_E |_D |_C     |_A , /* 6 */
                                                          _C |_B |_A , /* 7 */
                                      _G2|_G1|_F |_E |_D |_C |_B |_A , /* 8 */
                                      _G2|_G1|_F     |_D |_C |_B |_A , /* 9 */
                  _M         |_J                                     , /* : */
                      _N     |_J                                     , /* ; */
              _L         |_K             |_G1                        , /* < */
                                      _G2|_G1        |_D             , /* = */
                      _N         |_H |_G2                            , /* > */
          _DP    |_M                 |_G2                    |_B |_A , /* ? */
                              _J     |_G2    |_F |_E |_D     |_B |_A , /* @ */
                                      _G2|_G1|_F |_E     |_C |_B |_A , /* A */
                  _M         |_J     |_G2            |_D |_C |_B |_A , /* B */
                                              _F |_E |_D         |_A , /* C */
                  _M         |_J                     |_D |_C |_B |_A , /* D */
                                          _G1|_F |_E |_D         |_A , /* E */
                                          _G1|_F |_E             |_A , /* F */
                                      _G2    |_F |_E |_D |_C     |_A , /* G */
                                      _G2|_G1|_F |_E     |_C |_B     , /* H */
                  _M         |_J                     |_D         |_A , /* I */
                                                  _E |_D |_C |_B     , /* J */
              _L         |_K             |_G1|_F |_E                 , /* K */
                                              _F |_E |_D             , /* L */
                          _K     |_H         |_F |_E     |_C |_B     , /* M */
              _L                 |_H         |_F |_E     |_C |_B     , /* N */
                                              _F |_E |_D |_C |_B |_A , /* O */
                                      _G2|_G1|_F |_E         |_B |_A , /* P */
              _L                             |_F |_E |_D |_C |_B |_A , /* Q */
              _L                     |_G2|_G1|_F |_E         |_B |_A , /* R */
                                      _G2|_G1|_F     |_D |_C     |_A , /* S */
                  _M         |_J                                 |_A , /* T */
                                              _F |_E |_D |_C |_B     , /* U */
                      _N |_K                 |_F |_E                 , /* V */
              _L     |_N                     |_F |_E     |_C |_B     , /* W */
              _L     |_N |_K     |_H                                 , /* X */
                                      _G2|_G1|_F     |_D |_C |_B     , /* Y */
                      _N |_K                         |_D         |_A , /* Z */
                                              _F |_E |_D         |_A , /* [ */
              _L                 |_H                                 , /* \ */
                                                      _D |_C |_B |_A , /* ] */
              _L     |_N                                             , /* ^ */
                                                      _D             , /* _ */
                                  _H                                 , /* ` */
                  _M                     |_G1    |_E |_D             , /* a */
              _L                         |_G1|_F |_E |_D             , /* b */
                                      _G2|_G1    |_E |_D             , /* c */
                      _N             |_G2            |_D |_C |_B     , /* d */
                      _N                 |_G1    |_E |_D             , /* e */
                  _M     |_K         |_G2|_G1                        , /* f */
                          _K         |_G2            |_D |_C |_B     , /* g */
                  _M                     |_G1|_F |_E                 , /* h */
                  _M                                                 , /* i */
                      _N     |_J                 |_E                 , /* j */
              _L |_M     |_K |_J                                     , /* k */
                                              _F |_E                 , /* l */
                  _M                 |_G2|_G1    |_E     |_C         , /* m */
                  _M                     |_G1    |_E                 , /* n */
                                      _G2|_G1    |_E |_D |_C         , /* o */
                                  _H     |_G1|_F |_E                 , /* p */
                          _K         |_G2                |_C |_B     , /* q */
                                          _G1    |_E                 , /* r */
              _L                     |_G2            |_D             , /* s */
                                          _G1|_F |_E |_D             , /* t */
                                                  _E |_D |_C         , /* u */
                      _N                         |_E                 , /* v */
              _L     |_N                         |_E     |_C         , /* w */
              _L     |_N |_K     |_H                                 , /* x */
                              _J     |_G2            |_D |_C |_B     , /* y */
                      _N                 |_G1        |_D             , /* z */
                      _N         |_H     |_G1        |_D         |_A , /* { */
                  _M         |_J                                     , /* | */
              _L         |_K         |_G2            |_D         |_A , /* } */
                      _N |_K         |_G2|_G1                        , /* ~ */
          0                                                          , /* (del) */
};


/**
 *  @brief  Table for 7 segments displays
 *
 *  @note   Only used when trying to display alphabetic characters in the numeric display
 *  @note   For each character, it gives the segments to be lit
 *  @note   It uses a 16 bit word and each bit corresponds to a segment
 *  @note   0 position corresponds to space (0x20=32)
 *  @note   To get the segments for character c use segments14forchar[c-' ']

 *
 */

// bit-segment association. Symbols are reused!!!!
#if USE_7SEGMENTS_FOR_CHARS
#undef _DP
#undef _DP
#undef _G
#undef _F
#undef _E
#undef _D
#undef _C
#undef _B
#undef _A

