hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
#define _DP 0x80
#define _G  0x40
#define _F  0x20
#define _E  0x10
#define _D  0x8
#define _C  0x4
#define _B  0x2
#define _A  0x1

const uint8_t segment7forchar[96] = {
         0                              , /* (space) */
         _DP                |_C |_B     , /* ! */
                 _F             |_B     , /* " */
             _G |_F |_E |_D |_C |_B     , /* # */
             _G |_F     |_D |_C     |_A , /* $ */
         _DP|_G     |_E         |_B     , /* % */
             _G             |_C |_B     , /* & */
                 _F                     , /* ' */
                 _F     |_D         |_A , /* ( */
                         _D     |_B |_A , /* ) */
                 _F                 |_A , /* * */
             _G |_F |_E                 , /* + */
                     _E                 , /* , */
             _G                         , /* - */
         _DP                            , /* . */
             _G     |_E         |_B     , /* / */
                 _F |_E |_D |_C |_B |_A , /* 0 */
                             _C |_B     , /* 1 */
             _G     |_E |_D     |_B |_A , /* 2 */
             _G         |_D |_C |_B |_A , /* 3 */
             _G |_F         |_C |_B     , /* 4 */
             _G |_F     |_D |_C     |_A , /* 5 */
             _G |_F |_E |_D |_C     |_A , /* 6 */
                             _C |_B |_A , /* 7 */
             _G |_F |_E |_D |_C |_B |_A , /* 8 */
             _G |_F     |_D |_C |_B |_A , /* 9 */
                         _D         |_A , /* : */
                         _D |_C     |_A , /* ; */
             _G |_F                 |_A , /* < */
             _G         |_D             , /* = */
             _G                 |_B |_A , /* > */
         _DP|_G     |_E         |_B |_A , /* ? */
             _G     |_E |_D |_C |_B |_A , /* @ */
             _G |_F |_E     |_C |_B |_A , /* A */
             _G |_F |_E |_D |_C         , /* B */
                 _F |_E |_D         |_A , /* C */
             _G     |_E |_D |_C |_B     , /* D */
             _G |_F |_E |_D         |_A , /* E */
             _G |_F |_E             |_A , /* F */
                 _F |_E |_D |_C     |_A , /* G */
             _G |_F |_E     |_C |_B     , /* H */
                 _F |_E                 , /* I */
                     _E |_D |_C |_B     , /* J */
             _G |_F |_E     |_C     |_A , /* K */
                 _F |_E |_D             , /* L */
                     _E     |_C     |_A , /* M */
                 _F |_E     |_C |_B |_A , /* N */
                 _F |_E |_D |_C |_B |_A , /* O */
             _G |_F |_E         |_B |_A , /* P */
             _G |_F     |_D     |_B |_A , /* Q */
                 _F |_E         |_B |_A , /* R */
             _G |_F     |_D |_C     |_A , /* S */
             _G |_F |_E |_D             , /* T */
                 _F |_E |_D |_C |_B     , /* U */
                 _F |_E |_D |_C |_B     , /* V */
                 _F     |_D     |_B     , /* W */
             _G |_F |_E     |_C |_B     , /* X */
             _G |_F     |_D |_C |_B     , /* Y */
             _G     |_E |_D     |_B |_A , /* Z */
                 _F |_E |_D         |_A , /* [ */
             _G |_F         |_C         , /* \ */
                         _D |_C |_B |_A , /* ] */
                 _F             |_B |_A , /* ^ */
                         _D             , /* _ */
                                 _B     , /* ` */
             _G     |_E |_D |_C |_B |_A , /* a */
             _G |_F |_E |_D |_C         , /* b */
             _G     |_E |_D             , /* c */
             _G     |_E |_D |_C |_B     , /* d */
             _G |_F |_E |_D     |_B |_A , /* e */
             _G |_F |_E             |_A , /* f */
             _G |_F     |_D |_C |_B |_A , /* g */
             _G |_F |_E     |_C         , /* h */
                     _E                 , /* i */
                         _D |_C         , /* j */
             _G |_F |_E     |_C     |_A , /* k */
                 _F |_E                 , /* l */
                     _E     |_C         , /* m */
             _G     |_E     |_C         , /* n */
             _G     |_E |_D |_C         , /* o */
             _G |_F |_E         |_B |_A , /* p */
             _G |_F         |_C |_B |_A , /* q */
             _G     |_E                 , /* r */
             _G |_F     |_D |_C     |_A , /* s */
             _G |_F |_E |_D             , /* t */
                     _E |_D |_C         , /* u */
                     _E |_D |_C         , /* v */
                     _E     |_C         , /* w */
             _G |_F |_E     |_C |_B     , /* x */
             _G |_F     |_D |_C |_B     , /* y */
             _G     |_E |_D     |_B |_A , /* z */
             _G             |_C |_B     , /* { */
                 _F |_E                 , /* | */
             _G |_F |_E                 , /* } */
                                     _A , /* ~ */
         0                              , /* (del) */
};
#endif


/**
  *
  *  @brief  Configuration for LCD Segments
  *
  *  @note   There are two segment information. One in the display and the other in the controller
  *
  */

//
// LCD Matriz 20x8
//
//
//
//        LCD Seg   LCD Pin   LCD Controller        MCU Port      MCU Pin
//        S0          1         Seg 12      <--->    PA15           B1
//        S1          2         Seg 13      <--->    PA0            C2
//        S2          3         Seg 14      <--->    PA1            C1
//        S3          4         Seg 15      <--->    PA2            D2
//        S4          5         Seg 16      <--->    PA3            D1
//        S5          6         Seg 17      <--->    PA4            E3
//        S6          7         Seg 18      <--->    PA5            E2
//        S7          8         Seg 19      <--->    PA6            E1
//        S8          9         Seg 28      <--->    PD9            D6
//        S9         10         Seg 29      <--->    PD10           A5
//        S10        11         Seg 30      <--->    PD11           B5
//        S11        12         Seg 31      <--->    PD12           C5
//        S12        13         Seg 32      <--->    PB0            E4
//        S13        14         Seg 33      <--->    PB1            F1
//        S14        15         Seg 34      <--->    PB2            F2
//        S15        16         Seg 35      <--->    PA7            H4
//        S16        17         Seg 36      <--->    PA8            H5
//        S17        18         Seg 37      <--->    PA9            J5
//        S18        19         Seg 38      <--->    PA10           J6
//        S19        20         Seg 39      <--->    PA11           K5
//        COM7       21         Com 0       <--->    PB6            G2
//        COM6       22         Com 1       <--->    PB5            G1
//        COM5       23         Com 2       <--->    PB4            F4
//        COM4       24         Com 3       <--->    PB3            F3
//        COM3       25         Com 4       <--->    PE7            D9
//        COM2       26         Com 5       <--->    PE6            C9
//        COM1       27         Com 6       <--->    PE5            B9
//        COM0       28         Com 7       <--->    PD4            J11
//
//                              CAP+                 PA12           J4
//                              CAP-                 PA13           K3
//                              EXT                  PA14           L3
//


/**
 *  Segment information is encoded in a 16 bit word
 *  Each segment of display is addressed by a segment signal AND a common signal
 *  The high order byte contains the segment
 *  The lower order byte containts the common
 */
#define SEGS    20
#define COMMS   8

