hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
#define SEGMASK(X) ((X)<<8)
#define GET_SEG(M) ((M)>>8)
#define GET_COMMON(M) ((M)&0xFF)

#ifdef TWO_STEPS_ENCODING
/**
 *  TWO STEPS ENCODING
 *  In Two Steps Encoding, the LCD Segment Pin and Common Pin is found
 *  in lookup tables seg_encoding and com_encoding
 */

#define S00 SEGMASK(0)
#define S01 SEGMASK(1)
#define S02 SEGMASK(2)
#define S03 SEGMASK(3)
#define S04 SEGMASK(4)
#define S05 SEGMASK(5)
#define S06 SEGMASK(6)
#define S07 SEGMASK(7)
#define S08 SEGMASK(8)
#define S09 SEGMASK(9)
#define S10 SEGMASK(10)
#define S11 SEGMASK(11)
#define S12 SEGMASK(12)
#define S13 SEGMASK(13)
#define S14 SEGMASK(14)
#define S15 SEGMASK(15)
#define S16 SEGMASK(16)
#define S17 SEGMASK(17)
#define S18 SEGMASK(18)
#define S19 SEGMASK(19)

#define C0 0
#define C1 1
#define C2 2
#define C3 3
#define C4 4
#define C5 5
#define C6 6
#define C7 7
/////////////////////////// END OF TWO STEPS ENCODING //////////////////////////////////////////////

#else
/////////////////////////// BEGIN OF ONE STEP ENCODING /////////////////////////////////////////////
//
// In one step encoding, the Pins used are specified by preprocessor symbols
//

#define S00 SEGMASK(12)
#define S01 SEGMASK(13)
#define S02 SEGMASK(14)
#define S03 SEGMASK(15)
#define S04 SEGMASK(16)
#define S05 SEGMASK(17)
#define S06 SEGMASK(18)
#define S07 SEGMASK(19)
#define S08 SEGMASK(28)
#define S09 SEGMASK(29)
#define S10 SEGMASK(30)
#define S11 SEGMASK(31)
#define S12 SEGMASK(32)
#define S13 SEGMASK(33)
#define S14 SEGMASK(34)
#define S15 SEGMASK(35)
#define S16 SEGMASK(36)
#define S17 SEGMASK(37)
#define S18 SEGMASK(38)
#define S19 SEGMASK(39)

#define C0 7
#define C1 6
#define C2 5
#define C3 4
#define C4 3
#define C5 2
#define C6 1
#define C7 0


#endif

/*
 * @brief table for LCD 14 segments adjusted por position
 *
 * @note  basically, how to turn on a LCD segment knowing its position
 */
uint16_t tablcd[15][12] = {
//          P00     P01     P02     P03     P04     P05     P06     P07     P08     P09     P10     P11
/* A  */ { C7|S12, C6|S01, C6|S03, C6|S05, C6|S07, C7|S09, C7|S11, C6|S13, C0|S18, C0|S17, C0|S16, C0|S15 },
/* B  */ { C7|S13, C6|S02, C6|S04, C6|S06, C6|S08, C6|S10, C6|S12, C6|S14, C2|S18, C2|S17, C2|S16, C2|S15 },
/* C  */ { C7|S14, C2|S02, C2|S04, C2|S06, C2|S08, C2|S10, C2|S12, C2|S14, C5|S18, C5|S17, C5|S16, C5|S15 },
/* D  */ { C7|S15, C0|S02, C0|S04, C0|S06, C0|S08, C0|S10, C0|S12, C0|S14, C6|S18, C6|S17, C6|S16, C6|S15 },
/* E  */ { C6|S00, C0|S01, C0|S03, C0|S05, C0|S07, C1|S09, C1|S11, C0|S13, C4|S18, C4|S17, C4|S16, C4|S15 },
/* F  */ { C7|S17, C4|S01, C4|S03, C4|S05, C4|S07, C5|S09, C5|S11, C4|S13, C1|S18, C1|S17, C1|S16, C1|S15 },
/* G  */ { C7|S16, C3|S01, C3|S03, C3|S05, C3|S07, C4|S09, C4|S11, C3|S13, C3|S18, C3|S17, C3|S16, C3|S15 },
/* H  */ { C7|S18, C5|S01, C5|S03, C5|S05, C5|S07, C6|S09, C6|S11, C5|S13, C7|S19, C3|S00, C0|S00, C7|S07 },
/* J  */ { C0|S00, C4|S02, C4|S04, C4|S06, C4|S08, C4|S10, C4|S12, C4|S14, C6|S19, C0|S00, C0|S00, C7|S06 },
/* K  */ { C4|S19, C5|S02, C5|S04, C5|S06, C5|S08, C5|S10, C5|S12, C5|S14, C0|S19, C7|S10, C0|S00, C7|S05 },
/* M  */ { C5|S00, C3|S02, C3|S04, C3|S06, C3|S08, C3|S10, C3|S12, C3|S14, C5|S19, C2|S19, C0|S00, C7|S04 },
/* N  */ { C0|S00, C1|S02, C1|S04, C1|S06, C1|S08, C1|S10, C1|S12, C1|S14, C1|S19, C0|S00, C0|S00, C7|S03 },
/* P  */ { C0|S00, C2|S01, C2|S03, C2|S05, C2|S07, C3|S09, C3|S11, C2|S13, C0|S00, C0|S00, C0|S00, C7|S02 },
/* Q  */ { C0|S00, C1|S01, C1|S03, C1|S05, C1|S07, C2|S09, C2|S11, C1|S13, C4|S00, C0|S00, C0|S00, C7|S01 },
/* DP */ { C0|S00, C0|S00, C0|S00, C2|S00, C1|S00, C0|S09, C0|S11, C0|S00, C7|S08, C0|S00, C3|S19, C7|S00 }
};


#ifdef TWO_STEPS_ENCODING
//////////////////////////////// BEGIN OF TWO STEPS ENCODING ///////////////////////////////////////

const SegEncoding_t seg_encoding[] = {
    //   SEG19-16     SEG15-0
    {   0x00000000,  BIT(12)    },  //    S0       ->      Seg 12    SEGEN3
    {   0x00000000,  BIT(13)    },  //    S1       ->      Seg 13    SEGEN3
    {   0x00000000,  BIT(14)    },  //    S2       ->      Seg 14    SEGEN3
    {   0x00000000,  BIT(15)    },  //    S3       ->      Seg 15    SEGEN3
    {   0x00000000,  BIT(16)    },  //    S4       ->      Seg 16    SEGEN4
    {   0x00000000,  BIT(17)    },  //    S5       ->      Seg 17    SEGEN4
    {   0x00000000,  BIT(18)    },  //    S6       ->      Seg 18    SEGEN4
    {   0x00000000,  BIT(19)    },  //    S7       ->      Seg 19    SEGEN4
    {   0x00000000,  BIT(28)    },  //    S8       ->      Seg 28    SEGEN7
    {   0x00000000,  BIT(29)    },  //    S9       ->      Seg 29    SEGEN7
    {   0x00000000,  BIT(30)    },  //    S10      ->      Seg 30    SEGEN7
    {   0x00000000,  BIT(31)    },  //    S11      ->      Seg 31    SEGEN7
    {   BIT(32-32),  0x00000000 },  //    S12      ->      Seg 32    SEGEN8
    {   BIT(33-32),  0x00000000 },  //    S13      ->      Seg 33    SEGEN8
    {   BIT(34-32),  0x00000000 },  //    S14      ->      Seg 34    SEGEN8
    {   BIT(35-32),  0x00000000 },  //    S15      ->      Seg 35    SEGEN8
    {   BIT(36-32),  0x00000000 },  //    S16      ->      Seg 36    SEGEN0
    {   BIT(37-32),  0x00000000 },  //    S17      ->      Seg 37    SEGEN9
    {   BIT(38-32),  0x00000000 },  //    S18      ->      Seg 38    SEGEN9
    {   BIT(39-32),  0x00000000 },  //    S19      ->      Seg 39    SEGEN9
};

const uint8_t com_encoding[8] = { 7, 6, 5, 4, 3, 2, 1, 0 };


//////////////////////////////// END OF TWO STEPS ENCODING /////////////////////////////////////////

#else
//////////////////////////////// BEGIN OF ONE STEP ENCODING ////////////////////////////////////////

const uint32_t seg_encoding[] = {
  /* 0  */     BIT(0),
  /* 1  */     BIT(1),
  /* 2  */     BIT(2),
  /* 3  */     BIT(3),
  /* 4  */     BIT(4),
  /* 5  */     BIT(5),
  /* 6  */     BIT(6),
  /* 7  */     BIT(7),
  /* 8  */     BIT(8),
  /* 9  */     BIT(9),
  /* 10  */    BIT(10),
  /* 11  */    BIT(11),
  /* 12  */    BIT(12),
  /* 13  */    BIT(13),
  /* 14  */    BIT(14),
  /* 15  */    BIT(15),
  /* 16  */    BIT(16),
  /* 17  */    BIT(17),
  /* 18  */    BIT(18),
  /* 19  */    BIT(19),
  /* 20  */    BIT(20),
  /* 21  */    BIT(21),
  /* 22  */    BIT(22),
  /* 23  */    BIT(23),
  /* 24  */    BIT(24),
  /* 25  */    BIT(25),
  /* 26  */    BIT(26),
  /* 27  */    BIT(27),
  /* 28  */    BIT(28),
  /* 29  */    BIT(29),
  /* 30  */    BIT(30),
  /* 31  */    BIT(31),
  /* 32  */    BIT(0),
  /* 33  */    BIT(1),
  /* 34  */    BIT(2),
  /* 35  */    BIT(3),
  /* 36  */    BIT(4),
  /* 37  */    BIT(5),
  /* 38  */    BIT(6),
  /* 39  */    BIT(7)
};
//////////////////////////////// BEGIN OF ONE STEP ENCODING ////////////////////////////////////////
#endif


/**
 *   Table for clear a position before writing a new character onto it
 */

static const SegEncoding_t tablcdclear[12][8] = {
    /* Position  P00 */
    {
        /* C0  */       {   0, 0 },
        /* C1  */       {   0, 0 },
        /* C2  */       {   0, 0 },
        /* C3  */       {   0, 0 },
        /* C4  */       {   0, 0 },
        /* C5  */       {   0, 0 },
        /* C6  */       {   0, 0 },
        /* C7  */       {   0, 0 }
    },
    /* Position  P01 */
    {
        /* C0  */       {   0, BIT(13)|BIT(14) },           // Segments E and D
        /* C1  */       {   0, BIT(13)|BIT(14) },           // Segments Q and N
        /* C2  */       {   0, BIT(13)|BIT(14) },           // Segments P and C
        /* C3  */       {   0, BIT(13)|BIT(14) },           // Segments G and M
        /* C4  */       {   0, BIT(13)|BIT(14) },           // Segments F and J
        /* C5  */       {   0, BIT(13)|BIT(14) },           // Segments H and K
        /* C6  */       {   0, BIT(13)|BIT(14) },           // Segments A and B
        /* C7  */       {   0, 0 }                          //
    },
    /* Position  P02 */
    {
        /* C0  */       {   0, BIT(15)|BIT(16) },           // Segments E and D
        /* C1  */       {   0, BIT(15)|BIT(16) },           // Segments Q and N
        /* C2  */       {   0, BIT(15)|BIT(16) },           // Segments P and C
        /* C3  */       {   0, BIT(15)|BIT(16) },           // Segments G and M
        /* C4  */       {   0, BIT(15)|BIT(16) },           // Segments F and J
        /* C5  */       {   0, BIT(15)|BIT(16) },           // Segments H and K
        /* C6  */       {   0, BIT(15)|BIT(16) },           // Segments A and B
        /* C7  */       {   0, 0 }                          //
    },
    /* Position  P03 */
    {
        /* C0  */       {   0, BIT(17)|BIT(18) },           // Segments E and D
        /* C1  */       {   0, BIT(17)|BIT(18) },           // Segments Q and N
        /* C2  */       {   0, BIT(17)|BIT(18) },           // Segments P and C
        /* C3  */       {   0, BIT(17)|BIT(18) },           // Segments G and M
        /* C4  */       {   0, BIT(17)|BIT(18) },           // Segments F and J
        /* C5  */       {   0, BIT(17)|BIT(18) },           // Segments H and K
        /* C6  */       {   0, BIT(17)|BIT(18) },           // Segments A and B
        /* C7  */       {   0, 0 }                          //
    },
    /* Position  P04 */
    {
        /* C0  */       {   0, BIT(19)|BIT(28) },           // Segments E and D
        /* C1  */       {   0, BIT(19)|BIT(28) },           // Segments Q and N
        /* C2  */       {   0, BIT(19)|BIT(28) },           // Segments P and C
        /* C3  */       {   0, BIT(19)|BIT(28) },           // Segments G and M
        /* C4  */       {   0, BIT(19)|BIT(28) },           // Segments F and J
        /* C5  */       {   0, BIT(19)|BIT(28) },           // Segments H and K
        /* C6  */       {   0, BIT(19)|BIT(28) },           // Segments A and B
        /* C7  */       {   0, 0 }                          //
    },
    /* Position  P05 */
    {
        /* C0  */       {   0, BIT(30)       },             // Segment D
        /* C1  */       {   0, BIT(29)|BIT(30)},            // Segments E and N
        /* C2  */       {   0, BIT(29)|BIT(30)},            // Segments Q and C
        /* C3  */       {   0, BIT(29)|BIT(30)},            // Segments P and M
        /* C4  */       {   0, BIT(29)|BIT(30)},            // Segments G and J
        /* C5  */       {   0, BIT(29)|BIT(30)},            // Segments F and K
        /* C6  */       {   0, BIT(29)|BIT(30)},            // Segments H and B
        /* C7  */       {   0, BIT(19)        }             // Segment A
    },
    /* Position  P06 */
    {
        /* C0  */       {   BIT(32-32), 0      },           // Segment D
        /* C1  */       {   BIT(32-32), BIT(31)},           // Segments E and N
        /* C2  */       {   BIT(32-32), BIT(31)},           // Segments Q and C
        /* C3  */       {   BIT(32-32), BIT(31)},           // Segments P and M
        /* C4  */       {   BIT(32-32), BIT(31)},           // Segments G and J
        /* C5  */       {   BIT(32-32), BIT(31)},           // Segments F and K
        /* C6  */       {   BIT(32-32), BIT(31)},           // Segments H and B
        /* C7  */       {   0,          BIT(31)}            // Segment A

    },
    /* Position  P07 */
    {
        /* C0  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments E and D
        /* C1  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments Q and N
        /* C2  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments P and C
        /* C3  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments G and M
        /* C4  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments F and J
        /* C5  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments H and K
        /* C6  */       {   BIT(33-32)|BIT(34-32), 0 },     // Segments A and B
        /* C7  */       {   0, 0               }            //
    },
    /* Position  P08 */
    {
        /* C0  */       {  BIT(38-32),0     },              // Segment A
        /* C1  */       {  BIT(38-32),0     },              // Segment  F
        /* C2  */       {  BIT(38-32),0     },              // Segment  B
        /* C3  */       {  BIT(38-32),0     },              // Segment  G
        /* C4  */       {  BIT(38-32),0     },              // Segment  E
        /* C5  */       {  BIT(38-32),0     },              // Segment  C
        /* C6  */       {  BIT(38-32),0     },              // Segment  D
        /* C7  */       {   0, 0               }
    },
    /* Position  P09 */
    {
        /* C0  */       {  BIT(37-32),0     },              // Segment  A
        /* C1  */       {  BIT(37-32),0     },              // Segment  F
        /* C2  */       {  BIT(37-32),0     },              // Segment  B
        /* C3  */       {  BIT(37-32),0     },              // Segment  G
        /* C4  */       {  BIT(37-32),0     },              // Segment  E
        /* C5  */       {  BIT(37-32),0     },              // Segment  C
        /* C6  */       {  BIT(37-32),0     },              // Segment  D
        /* C7  */       {   0, 0               }
    },
    /* Position  P10 */
    {
        /* C0  */       {  BIT(36-32),0     },              // Segment  A
        /* C1  */       {  BIT(36-32),0     },              // Segment  F
        /* C2  */       {  BIT(36-32),0     },              // Segment  B
        /* C3  */       {  BIT(36-32),0     },              // Segment  G
        /* C4  */       {  BIT(36-32),0     },              // Segment  E
        /* C5  */       {  BIT(36-32),0     },              // Segment  C
        /* C6  */       {  BIT(36-32),0     },              // Segment  D
        /* C7  */       {   0, 0               }
   },
    /* Position  P11 */
    {
        /* C0  */       {  BIT(35-32),0     },              // Segment  A
        /* C1  */       {  BIT(35-32),0     },              // Segment  F
        /* C2  */       {  BIT(35-32),0     },              // Segment  B
        /* C3  */       {  BIT(35-32),0     },              // Segment  G
        /* C4  */       {  BIT(35-32),0     },              // Segment  E
        /* C5  */       {  BIT(35-32),0     },              // Segment  C
        /* C6  */       {  BIT(35-32),0     },              // Segment  D
        /* C7  */       {   0, 0               }

    },
};

