hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
/*
 * This array emulates the LCD data registers
 */
#ifdef LCD_EMULATION
typedef struct {
    uint32_t hi;
    uint32_t lo;
} lcddata_t;

lcddata_t lcd[8];
#endif


/**
 * @brief   Set Clock for LCD module
 *
 * @note    LFACLK is the clock Source for the LCD module. Must be set before using LCD.
 *          It can be driven by LFRCOCLK, HFCORECLK/2, LFXOCLK and UFLCDOCLK
 *
 * @param   source can be
 *               LCD_CLK_DEFAULT : uses LFRCO as source
 *               LCD_CLK_LFRCO   : uses the internal RC oscillator with 32768 Hz
 *               LCD_CLK_ULRCO   : uses the internal RC oscillator with 1 or 2 kHz
 *               LCD_CLK_HFCORECLK_2 : user HFCORE clock signal divided by 2
 *               LCD_CLK_LFXO    : uses externa crystal oscillator with 32768 Hz
 *
 * @note     It disables clock for LCD, LETIMER0, RTC and LESENSE but restore them at the end.
 * @note     It disables the LCD module.
 */
uint32_t
SetLFAClock(uint32_t source) {

#ifdef LCD_EMULATION
    /* Set flag to signalize clock is set */
    lcdclock_set = 1;
    return 0;
#else
uint32_t oldlfaclken0,lfclksel;

    if( source == LCD_CLOCK_DEFAULT )
        source = LCD_CLOCK_LFRCO;

    /* If LCD active, disable it. It is not restored */
    if( LCD->CTRL&LCD_CTRL_EN ) {
        LCD->CTRL &= ~(LCD_CTRL_EN);
    }

    /*
     * LFACLK is the selected clock for these Low Energy A Peripherals:
     *    LCD, LETIMER0, RTC and LESENSE
     *
     * The clocks for these devices are disabled, but configuration is saved to be restored later
     */
    oldlfaclken0 = CMU->LFACLKEN0;
    CMU->LFACLKEN0 &= ~(CMU_LFACLKEN0_LCD|CMU_LFACLKEN0_LETIMER0
                       |CMU_LFACLKEN0_RTC|CMU_LFACLKEN0_LESENSE);

    /*
     * It can be driven by LFRCO (default), LFXO, HFCORECLK/2, HFCORECLK/4 or ULFRCO (BURTC)
     * Note that LFRCO is disabled at reset !!!!!! It is enabled bt writing a word with the
     * LFRCOEN bit set to the OSCENCMD register.
     *
     *
     * The source for the LFACLK in selected by the LFA and LFAE fields in CMU->LFCLKSEL
     * More information in section 11.5.11 of reference manual
     *
     *    LFA   LFAE      source
     *     00     0       disabled
     *     00     1       UFLRCO
     *     01     0       LFRCO
     *     10     0       LFXO
     *     11     0       HFCORECLK/2
     *
     * The LCD clock has:
     *    a prescaler (CMU->LFAPRESC0.LCD) and
     *    a frame rate controller (CMU->LCDCTRL.FDIV)
     *    a clock enable (CMU->LFACLKEN0.LCD)
     */

    /* ??
     * Ensure LE modules are accessible, by setting LE bit to enable the clock for the
     * low energy modules. It enables bus access to Low Energy peripherals.
     *
     * To use LCD module, the LE interface clock must be enabled in CMU_HFCORECLKEN0,
     * in addition to the module clock
     */
     CMU->HFCORECLKEN0 |= CMU_HFCORECLKEN0_LE;

    /*
     * First, configure and enable the clock source for the LCD module
     */
    switch ( source ) {
    case LCD_CLOCK_LFRCO:
        /*
         * Set LFRCO as LFACLK clock source
         *
         * LFRCO is a RC oscillator withe a nominal frequency of 32768 Hz.
         * Following contents of
         * http://embeddedelectrons.blogspot.com/2016/12/example-code-for-segment-lcd-on-efm32.html
         */

        /*
         * Set LFRCOEN bit to enable the low frequency RC oscillator (LFRCO)
         */
        CMU->OSCENCMD = CMU_OSCENCMD_LFRCOEN;
        /*
         * Wait until LFRCO is enabled and start-up time has exceeded
         */
        while ( !(CMU->STATUS&CMU_STATUS_LFRCORDY) ) {}

        /*
         * Set the LFACLK to use LFRCO as clock source
         *
         */
        lfclksel  = CMU->LFCLKSEL;
        lfclksel &= ~CMU_LFCLKSEL_LFAE_ULFRCO;  // Clear LFAE bit
        lfclksel &= ~_CMU_LFCLKSEL_LFA_MASK;    // Clear LFA field
        lfclksel |= CMU_LFCLKSEL_LFA_LFRCO;    // Set LFRCO as LFACLK clock source
        CMU->LFCLKSEL = lfclksel;
        break;
    case LCD_CLOCK_HFCORECLK_2:
        /*
         * Additional division factor for HFCORECLKLE
         * See 11.5.2
         * This can only be done when HFCORECLK <= 32 MHz
         */
        if( SystemCoreClock < 32000000 ) {
             CMU->HFCORECLKDIV &= ~CMU_HFCORECLKDIV_HFCORECLKLEDIV;
        }


        /*
         * Set HFCORECLK/2 as LFACLK clock source
         * HFCORECLK is derived from the HFCORECLK
         * This is configured in the LFCLKSEL register
         * See RM section 11.5.11
         */
        lfclksel  = CMU->LFCLKSEL;
        lfclksel &= ~CMU_LFCLKSEL_LFAE_ULFRCO;  // Clear LFAE bit
        lfclksel &= ~_CMU_LFCLKSEL_LFA_MASK;    // Clear LFA field
        lfclksel |= CMU_LFCLKSEL_LFA_HFCORECLKLEDIV2;
                                                // Set HFCOREPERCLK_2 as LFACLK clock source
        CMU->LFCLKSEL = lfclksel;
        break;
    case LCD_CLOCK_HFCORECLK_4:
        /*
         * Additional division factor for HFCORECLKLE
         * See 11.5.2
         */
         CMU->HFCORECLKDIV |= CMU_HFCORECLKDIV_HFCORECLKLEDIV;

        /*
         * Set HFCORECLK/4 as LFACLK clock source
         * HFCORECLK is derived from the HFCORECLK
         * This is configured in the LFCLKSEL register
         * See RM section 11.5.11
         */
        lfclksel  = CMU->LFCLKSEL;
        lfclksel &= ~CMU_LFCLKSEL_LFAE_ULFRCO;  // Clear LFAE bit
        lfclksel &= ~_CMU_LFCLKSEL_LFA_MASK;    // Clear LFA field
        lfclksel |= CMU_LFCLKSEL_LFA_HFCORECLKLEDIV2;
                                                // Set HFCOREPERCLK_2 as LFACLK clock source
        CMU->LFCLKSEL = lfclksel;
        break;
    case LCD_CLOCK_ULFRCO:
        /*
         * Set ULFRCO as LFACLK clock source
         *
         * ULFRCO is a RC oscillator with a nominal frequency of 1 or 2 KHz (depends on the chip??)
         * ULFRCO is enable by default. It can only be disabled by selection other
         * clock source in the OSC field of the EMU_EMF4CONF register
         *
         * NOTE: The instruction below changes the clock source for the Energy Mode 4 (EM4)!!!!!!
         *       This can be disable by defining DO_NOT_RECONFIGURE_EM4OSC compiler flag
         *
         */
#ifndef DO_NOT_RECONFIGURE_EM4OSC
        EMU->EM4CONF &= ~_EMU_EM4CONF_OSC_MASK;
#endif

