hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
        /*
         * Configure ULFRCO as LFACLK clock source
         * This is configured in the LFCLKSEL register
         * See RM section 11.5.11
         */
        lfclksel  = CMU->LFCLKSEL;
        lfclksel |= CMU_LFCLKSEL_LFAE_ULFRCO;  // Clear LFAE bit
        lfclksel &= ~_CMU_LFCLKSEL_LFA_MASK;   // Clear LFA field
        CMU->LFCLKSEL = lfclksel;
        break;

    case LCD_CLOCK_LFXO:
        /*
         * Set ULFRCO as LFACLK clock source
         *
         * LFXO is an oscillator that uses a external 32768 Hz crystal
         */

        // If LFXO is NOT enabled, enable it
        if ( (CMU->STATUS&CMU_STATUS_LFXOENS) == 0 ) {
            CMU->OSCENCMD  = CMU_OSCENCMD_LFXOEN;
        }

        lfclksel  = CMU->LFCLKSEL;
        lfclksel &= ~CMU_LFCLKSEL_LFAE_ULFRCO;  // Clear LFAE bit
        lfclksel &= ~_CMU_LFCLKSEL_LFA_MASK;    // Clear LFA field
        lfclksel |= CMU_LFCLKSEL_LFA_LFXO;      // Set LFXCO as LFACLK clock source
        CMU->LFCLKSEL = lfclksel;
        break;
    }

    /* if LFACK not active then return and signalizes error */
    if( (CMU->LFCLKSEL & (_CMU_LFCLKSEL_LFA_MASK|CMU_LFCLKSEL_LFAE)) == 0 ) {
        return 1;
    }

    /* Restore clocks for devices */
    CMU->LFACLKEN0 = oldlfaclken0;

    /* Set flag to signalize clock is set */
    lcdclock_set = 1;

    return 0;
#endif
}



/**
 *  @brief  SetLCDClock
 *
 */
uint32_t LCD_SetClock(uint32_t presc, uint32_t div) {


    if( presc == LCD_PRESC_DEFAULT )
        presc = LCD_PRESC_DIV16;

    if( div == LCD_DIV_DEFAULT ) {
        div = 0;
    } else {
        div--;
        if ( div > 7 ) div = 7;
    }

    /* Configure LCD Clock */
    CMU->LFAPRESC0 =    (CMU->LFAPRESC0&(~_CMU_LFAPRESC0_LCD_MASK))
                    |   presc<<_CMU_LFAPRESC0_LCD_SHIFT;

    CMU->LCDCTRL =      (CMU->LCDCTRL&(~_CMU_LCDCTRL_FDIV_MASK))
                    |   (div<<_CMU_LCDCTRL_FDIV_SHIFT);

    return 0;
}
/**
 *  @brief  Initializes LCD
 */
uint32_t LCD_Init(void) {
uint32_t rc;

    rc = LCD_Config(LCD_PRESC_DEFAULT,LCD_DIV_DEFAULT);

    return rc;
}

/*
 *  @brief  Configure LCD
 *
 *  @param  div:  set the frame rate according the formulas below
 *
 *  @note   frame_rate = (LFACK_freq/PRESC)/DIV/(MUX*2)
 *          where LFACLK_freq is the frequency of the LFACLK clock signal
 *                PRESC is the prescaler (16,32,64 or 128) set on LFAPRESC0 register
 *                DIV is the divisor set in the FDIV field of LCDCTRL register  (= DIV-1)
 *                MUX is the divisor set by the multiplexing mode
 *                    = 1 static
 *                      2 duplex
 *                      3 triples
 *                      4 quadruplex
 *                      6 hexplex
 *                      8 octaplex
 *
 *  @note   DIV = (LFACLK_freq/PRESC)/(frame_rate*MUX*2)
 *  @note   FDIV = DIV - 1
 *
 *  @note   When LCD_EMULATION is set, all write operations happen to a 8 position array
 *
 *  @note The table below show values of PRESC and FDIC that gives frame rate between 24 and 150
 *
  LFACLK freq |PRESC| LFACLK_presc|   DIV | FDIV | LFACLK_lcd  | Multiplexing | MUX |  Frame rate
 -------------|-----|-------------|-------|------|-------------|--------------|-----|------------
      32678   | 16  |      2048   |     1 |   0  |      2.048  |    Octaplex  |   8 |      128
      32678   | 16  |      2048   |     2 |   1  |      1.024  |    Octaplex  |   8 |       64
      32678   | 16  |      2048   |     3 |   2  |        683  |    Octaplex  |   8 |       43
      32678   | 16  |      2048   |     4 |   3  |        512  |    Octaplex  |   8 |       32
      32678   | 16  |      2048   |     5 |   4  |        410  |    Octaplex  |   8 |       26
      32678   | 32  |      1024   |     1 |   0  |      1.024  |    Octaplex  |   8 |       64
      32678   | 32  |      1024   |     2 |   1  |        512  |    Octaplex  |   8 |       32
      32678   | 64  |       512   |     1 |   0  |        512  |    Octaplex  |   8 |       32
 *
 *  @note  The default is PRESC=16 and FDIV=0 resulting in a 128 Hz frame rate
 *
 */
uint32_t LCD_Config(uint32_t presc, uint32_t div) {
#ifdef LCD_EMULATION
int i;

    /* Initializes area for segment information */
    for(i=0;i<8;i++) {
        lcd[i].hi = 0;
        lcd[i].lo = 0;
    }
#else
uint32_t segen;
int i;
uint32_t dispctrl;
#ifdef TWO_STEPS_ENCODING
uint32_t m,m4;
SegEncoding_t used = { 0,0 };
#else
int j;
#endif

    /*
     * Disable LCD module before fussing around with it
     */
    LCD->CTRL &= ~(LCD_CTRL_EN);

    /* If clock no set, configure it */
    if( !lcdclock_set ) {
        SetLFAClock(LCD_CLOCK_DEFAULT);
        LCD_SetClock(LCD_PRESC_DEFAULT,LCD_DIV_DEFAULT);
    }
#ifdef TWO_STEPS_ENCODING

    /*
     * Scan all character encoding and accumulates all bits used */
    for(i=0;i<sizeof(seg_encoding)/sizeof(SegEncoding_t);i++) {
        used.hi |= seg_encoding[i].hi;
        used.lo |= seg_encoding[i].lo;
    }

    /*
     * Configure pins
     * A bit in the segen register corresponds to 4 segment pins
     */
    m = 1;
    m4 = 0xF;
    segen = 0;
    while ( (m&BIT(8)) == 0 ) {
        if( (used.lo & m4) != 0 ) {
            segen |= m;
        }
        m <<= 1;
        m4 <<= 4;
    }
    while ( (m&BIT(10)) == 0 ) {
        if( (used.hi & m4) != 0 ) {
            segen |= m;
        }
        m <<= 1;
        m4 <<= 4;
    }
#else
    /* Accumulate all segments used in the tablcd table and configure the corresponding pins */
    segen = 0;
    for(i=0;i<15;i++) {
        for(j=0;j<12;j++) {
            segen |= (1<<(GET_SEG(tablcd[i][j]))/4);
        }
    }
#endif

    LCD->SEGEN = segen;

    dispctrl = LCD->DISPCTRL;
    dispctrl &= ~(   _LCD_DISPCTRL_MUXE_MASK
                   | _LCD_DISPCTRL_MUX_MASK
                   | _LCD_DISPCTRL_BIAS_MASK
                   | _LCD_DISPCTRL_WAVE_MASK
                   | _LCD_DISPCTRL_VLCDSEL_MASK
                   | _LCD_DISPCTRL_CONCONF_MASK   );

    // 8 common pins: LCD_COM7-LCD_COM4 (SEG23-SEG20) . LCD_COM3-LCD_COM0
    dispctrl  |=   LCD_DISPCTRL_MUX_QUADRUPLEX      // QUADRUPLEX+MUXE -> OCTAPLEX
                 | LCD_DISPCTRL_MUXE                //
                 | LCD_DISPCTRL_BIAS_ONEFOURTH      // 1/4 bias
                 | LCD_DISPCTRL_WAVE_NORMAL;        // Normal wave
    LCD->DISPCTRL = dispctrl;

