hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
    /*
     * Enable LCD after configuration
     */
    LCD->CTRL |= LCD_CTRL_EN;
#endif
    return 0;
}

/**
 *  @brief  Write an ASCII character at the specified position
 *
 *  @param  c:   character to be written
 *  @param  pos: position where character is to be written
 *
 *  @note   When LCD_EMULATION is set, all writes happen to a 8 position array
 *
 */
void LCD_WriteChar(uint8_t c, uint8_t pos) {
uint32_t segments,m;
uint8_t sn,com,seg;
SegEncoding_t s[8] = { {0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0} };

    /*
     * looks for segments to be lit
     * table contains only character with
     */
    segments = segments14forchar[c-' '];

    sn = 0;
    while( segments ) {
        if( segments&1 ) {
            m = tablcd[sn][pos];
            com = GET_COMMON(m);
            seg = GET_SEG(m);
#ifdef TWO_STEPS_ENCODING
            com = com_encoding[com]; // it is reversed on STK3700
            s[com].hi |= seg_encoding[seg].hi;
            s[com].lo |= seg_encoding[seg].lo;
#else
            if( seg < 32 ) {
                s[com].lo |= seg_encoding[seg];
            } else {
                s[com].hi |= seg_encoding[seg-32];
            }
#endif
        }
        segments>>=1;
        sn++;
    }
#ifndef LCD_EMULATION
    LCD->FREEZE |= LCD_FREEZE_REGFREEZE;
    for(com=0;com<8;com++) {
        switch(com) {
        case 0:
            LCD->SEGD0L = (LCD->SEGD0L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD0H = (LCD->SEGD0H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 1:
            LCD->SEGD1L = (LCD->SEGD1L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD1H = (LCD->SEGD1H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 2:
            LCD->SEGD2L = (LCD->SEGD2L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD2H = (LCD->SEGD2H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 3:
            LCD->SEGD3L = (LCD->SEGD3L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD3H = (LCD->SEGD3H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 4:
            LCD->SEGD4L = (LCD->SEGD4L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD4H = (LCD->SEGD4H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 5:
            LCD->SEGD5L = (LCD->SEGD5L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD5H = (LCD->SEGD5H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 6:
            LCD->SEGD6L = (LCD->SEGD6L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD6H = (LCD->SEGD6H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 7:
            LCD->SEGD7L = (LCD->SEGD7L&~tablcdclear[com][pos].lo)|s[com].lo;
            LCD->SEGD7H = (LCD->SEGD7H&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        }
    }
    LCD->FREEZE &= ~LCD_FREEZE_REGFREEZE;
#else
    for(com=0;com<8;com++) {
        switch(com) {
        case 0:
            lcd[0].lo = (lcd[0].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[0].hi = (lcd[0].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 1:
            lcd[1].lo = (lcd[1].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[1].hi = (lcd[1].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 2:
            lcd[2].lo = (lcd[2].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[2].hi = (lcd[2].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 3:
            lcd[3].lo = (lcd[3].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[3].hi = (lcd[3].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 4:
            lcd[4].lo = (lcd[4].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[4].hi = (lcd[4].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 5:
            lcd[5].lo = (lcd[5].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[5].hi = (lcd[5].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 6:
            lcd[6].lo = (lcd[6].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[6].hi = (lcd[6].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        case 7:
            lcd[7].lo = (lcd[7].lo&~tablcdclear[com][pos].lo)|s[com].lo;
            lcd[7].hi = (lcd[7].hi&~tablcdclear[com][pos].hi)|s[com].hi;
            break;
        }
    }
#endif


}

/**
 *  @brief  Write a string to positions 1 to 7 (with 14 segments displays)
 *
 *  @param  s: string to be written
 *
 *  @note   if the string is shorten than 7, it is padded with spaces
 */

void LCD_WriteAlphanumericField(char *s) {
int pos;

    for(pos=1;pos<=7;pos++) {
        if( *s ) {
            LCD_WriteChar(*s++,pos);
        } else {
            LCD_WriteChar(' ',pos);
        }
    }

}

/**
 *  @brief  Write a string into positions 8 to 11 (with 7 segments displays)
 *
 *  @param  s: string to be written
 *
 *  @note   if the string is shorten than 12, it is padded with spaces
 *
 */
void LCD_WriteNumericField(char *s) {
int pos;

    for(pos=8;pos<=12;pos++) {
        if( *s ) {
            LCD_WriteChar(*s++,pos);
        } else {
            LCD_WriteChar(' ',pos);
        }
    }

}

/**
 *  @brief  Write a string to positions 1 to 12 (with 14 segments displays in position 1 to 7)
 *          and 7 segments display in position 8 to 12)
 *
 *  @param  s: string to be written
 *
 *  @note   if the string is shorten than 12, it is padded with spaces
 */

void LCD_WriteString(char *s) {
int pos;

    for(pos=1;pos<=12;pos++) {
        if( *s ) {
            LCD_WriteChar(*s++,pos);
        } else {
            LCD_WriteChar(' ',pos);
        }
    }

}



/**
 *  @brief  Turns on/off a special segment
 *
 */
void LCD_SetSpecial(uint8_t c, uint8_t v) {
    // TBD
}

/**
 *  @brief  Turns off all segments
 *
 */
void LCD_Clear(void) {
#ifdef LCD_EMULATION
int i;

    for(i=0;i<8;i++) {
        lcd[i].hi = 0;
        lcd[i].lo = 0;
    }
#else
    LCD->SEGD0L = 0;
    LCD->SEGD0H = 0;
    LCD->SEGD1L = 0;
    LCD->SEGD1H = 0;
    LCD->SEGD2L = 0;
    LCD->SEGD2H = 0;
    LCD->SEGD3L = 0;
    LCD->SEGD3H = 0;
    LCD->SEGD4L = 0;
    LCD->SEGD4H = 0;
    LCD->SEGD5L = 0;
    LCD->SEGD5H = 0;
    LCD->SEGD6L = 0;
    LCD->SEGD6H = 0;
    LCD->SEGD7L = 0;
    LCD->SEGD7H = 0;
#endif
}

/**
 *  @brief  Turns on all segments
 *
 */
void LCD_SetAll(void) {
#ifdef LCD_EMULATION
int i;

    for(i=0;i<8;i++) {
        lcd[i].hi = 0xFF;
        lcd[i].lo = 0xFFFFFFFF;
    }
#else
    LCD->SEGD0L = 0xFFFFFFFF;
    LCD->SEGD0H = 0xFF;
    LCD->SEGD1L = 0xFFFFFFFF;
    LCD->SEGD1H = 0xFF;
    LCD->SEGD2L = 0xFFFFFFFF;
    LCD->SEGD2H = 0xFF;
    LCD->SEGD3L = 0xFFFFFFFF;
    LCD->SEGD3H = 0xFF;
    LCD->SEGD4L = 0xFFFFFFFF;
    LCD->SEGD4H = 0xFF;
    LCD->SEGD5L = 0xFFFFFFFF;
    LCD->SEGD5H = 0xFF;
    LCD->SEGD6L = 0xFFFFFFFF;
    LCD->SEGD6H = 0xFF;
    LCD->SEGD7L = 0xFFFFFFFF;
    LCD->SEGD7H = 0xFF;
#endif
}

/**
 *  @brief find the log2 of an integer
 *  @note  y = ln2(x)  <=>  2^x = y
 *  @note  if y is not a power of 2, returns the largest x such that 2^x < y
 *  @note  used to find the encoding needed for a divisor
 */
static uint32_t ln2(uint32_t x) {
uint32_t n = 0;
uint32_t v;

    v = 1;
    while( v < x ) {
        v <<= 1;
        n++;
    }

    return n;
}

#define LCD_USEVDD          0
#define LCD_USEVBOOST       1
/**
 *
 */
void LCD_SetVoltage(uint32_t source, uint32_t div, uint32_t level ) {
uint32_t d;
uint32_t lcdctrl, dispctrl;

    d = ln2(div);

    // Set LCD to use VDD
    LCD->DISPCTRL = (LCD->DISPCTRL&~_LCD_DISPCTRL_VLCDSEL_MASK)|_LCD_DISPCTRL_VLCDSEL_VDD;
    // Disable VBoost
    CMU->LCDCTRL &= ~CMU_LCDCTRL_VBOOSTEN;

