hans-jorg/efm32gg-stk3700-gcc-cmsis/19-LCD/lcd.c
    // If source VDD nothing more to do
    if( source == LCD_USEVDD )
        return;

    /*
     * Configure VBoost: frequency in CMU->LCDCTRL and level in LCD->DISPCTRL
     */
    // Read registers
    lcdctrl  = CMU->LCDCTRL;
    dispctrl = LCD->DISPCTRL;
    // Clear fields
    lcdctrl &= ~_CMU_LCDCTRL_VBFDIV_MASK;
    dispctrl &= _LCD_DISPCTRL_VBLEV_MASK;
    // Configure frequency
    lcdctrl |= (d<<_CMU_LCDCTRL_VBFDIV_SHIFT)&_CMU_LCDCTRL_VBFDIV_MASK;
    // Configure level
    dispctrl |= (level<<_LCD_DISPCTRL_VBLEV_SHIFT)&_LCD_DISPCTRL_VBLEV_MASK;
    // Write registers
    LCD->DISPCTRL = dispctrl;
    CMU->LCDCTRL  = lcdctrl;
    // Before exiting, reenable
    CMU->LCDCTRL |= CMU_LCDCTRL_VBOOSTEN;   // Reenable VBoost

    // Set LCD to use Boost
    LCD->DISPCTRL = (LCD->DISPCTRL&~_LCD_DISPCTRL_VLCDSEL_MASK)|_LCD_DISPCTRL_VLCDSEL_VEXTBOOST;
}



/**
 *
 */
void LCD_SetContrast(uint32_t level, uint32_t ref) {
uint32_t dispctrl;

    // Read register
    dispctrl = LCD->DISPCTRL;
    // Clear bits
    dispctrl &= ~(_LCD_DISPCTRL_CONCONF_MASK|_LCD_DISPCTRL_CONLEV_MASK);
    // Set level
    dispctrl |= (level<<_LCD_DISPCTRL_CONLEV_SHIFT)&_LCD_DISPCTRL_CONLEV_MASK;
    // Set reference
    dispctrl |= (ref<<_LCD_DISPCTRL_CONCONF_SHIFT)&_LCD_DISPCTRL_CONCONF_MASK;
    // Write register
    LCD->DISPCTRL = dispctrl;

}

/**
 * @brief Write a segment using segment mask
 */
void LCD_WriteSegment(uint32_t com, SegEncoding_t s, uint32_t v) {

    if( v ) { /* Set */
        switch(com) {
        case 0:
            LCD->SEGD0L |= s.lo;
            LCD->SEGD0H |= s.hi;
            break;
        case 1:
            LCD->SEGD1L |= s.lo;
            LCD->SEGD1H |= s.hi;
            break;
        case 2:
            LCD->SEGD2L |= s.lo;
            LCD->SEGD2H |= s.hi;
            break;
        case 3:
            LCD->SEGD3L |= s.lo;
            LCD->SEGD3H |= s.hi;
            break;
        case 4:
            LCD->SEGD4L |= s.lo;
            LCD->SEGD4H |= s.hi;
            break;
        case 5:
            LCD->SEGD5L |= s.lo;
            LCD->SEGD5H |= s.hi;
            break;
        case 6:
            LCD->SEGD6L |= s.lo;
            LCD->SEGD6H |= s.hi;
            break;
        case 7:
            LCD->SEGD7L |= s.lo;
            LCD->SEGD7H |= s.hi;
            break;
        }
    } else { /* Clear */
        switch(com) {
        case 0:
            LCD->SEGD0L &= ~s.lo;
            LCD->SEGD0H &= ~s.hi;
            break;
        case 1:
            LCD->SEGD1L &= ~s.lo;
            LCD->SEGD1H &= ~s.hi;
            break;
        case 2:
            LCD->SEGD2L &= ~s.lo;
            LCD->SEGD2H &= ~s.hi;
            break;
        case 3:
            LCD->SEGD3L &= ~s.lo;
            LCD->SEGD3H &= ~s.hi;
            break;
        case 4:
            LCD->SEGD4L &= ~s.lo;
            LCD->SEGD4H &= ~s.hi;
            break;
        case 5:
            LCD->SEGD5L &= ~s.lo;
            LCD->SEGD5H &= ~s.hi;
            break;
        case 6:
            LCD->SEGD6L &= ~s.lo;
            LCD->SEGD6H &= ~s.hi;
            break;
        case 7:
            LCD->SEGD7L &= ~s.lo;
            LCD->SEGD7H &= ~s.hi;
            break;
        }
    }
}

/**
 * @brief Write a segment using segment number
 */
void LCD_WriteSegment2(uint32_t com, uint32_t segn, uint32_t v) {
SegEncoding_t s;

    if( segn > 31 ) {
        s.hi = BIT(segn-32);
        s.lo = 0;
    } else {
        s.hi = 0;
        s.lo = BIT(segn);
    }
    LCD_WriteSegment(com,s,v);
}
